const choices = {
  '0': 'Повчити ІТ',
  '1': 'Піти в зал',
  '2': 'Піти бухати з пацанами',
  '3': 'Повчити бази',
  '4': 'Повчити python',
  '5': 'Написати Данилу і Оресту',
  '6': 'Піти самому',
  '7': 'Зареєструватись',
  '8': 'Зареєструватись',
  '9': 'Не реєстровуватись',
  '10': 'Лишити python',
  '11': 'Жити в кайф',
  '12': 'Інвестувати'
}

const afterChoices = {
  '0': 1,
  '1': 2,
  '2': '_1',
  '3': 3,
  '4': 4,
  '5': 6,
  '6': 7,
  '7': '_0',
  '8': '_3',
  '9': '_1',
  '10': 5,
  '11': '_5',
  '12': '_6'
}

const afterVideos = {
  '0': [0, 1, 2],
  '1': [3, 4],
  '2': [5, 6],
  '3': [7, 9],
  '4': [10, 3],
  '5': [8, 9],
  '6': '_4',
  '7': '_2',
  '_0': 'END',
  '_1': 'END',
  '_2': 'END',
  '_3': [11, 12],
  '_4': [11, 12],
  '_5': '8',
  '_6': '8',
  '8': 'BACKSTAGE'
}

const videoShowChoiceDelays = {
  '0': 1000,
  '1': 1000,
  '2': 1000,
  '3': 1000,
  '4': 1000,
  '5': 1000,
  '6': 1000,
  '7': 1000,
  '_3': 10000,
  '_4': 10000
}

const getStory = (storyId) => {
  switch (storyId) {
    case '_0':
      return {
        text: 'Пройшло 3 місяці, мене вигнали з курсу. Я вирішив, що ІТ це не моє і спився. Кінець (1 з 3 концівок)',
        isTheEnd: true
      }
    case '_1':
      return {
        text: 'Я вирішив, шо ІТ це не моє і спився. Кінець (1 з 3 концівок)',
        isTheEnd: true
      }
    case '_2':
      return {
        text: 'Подорозі до залу я зустрів своїх друзів, вони вмовили мене піти бухати, через деякий час я вирішив, шо ІТ це не моє і спився. Кінець (1 з 3 концівок)',
        isTheEnd: true
      }
    case '_3':
      return {
        text: 'Через деякий час я з другом влаштувались на роботу і косили великі бабки',
        isTheEnd: false
      }
    case '_4':
      return {
        text: 'Подорозі до залу підараси кликали бухати, але навпроти вже йшли друзі, з якими я домовився піти в зал і ми були чітко налаштовані качати свої баночки. В залі ми зустріли Бодника, який дав нам сильну мотивацію вчитись. Через деякий час я з другом влаштувались на роботу і косили великі бабки',
        isTheEnd: false
      }
    case '_5':
      return {
        text: 'Я знюхався і спився, після чого мене відпіздив Михайло, за те що я так і не створив ІТ компанію і не влаштував його туди. Я прожив старість самотньо. Кінець (2 з 3 кінцівок)',
        isTheEnd: true
      }
    case '_6':
      return {
        text: 'Я став міліардером і в свої 27 років запускаю разом з Маском ракети (тільки моя ракета більша). Кінець (3 з 3 кінцівок)',
        isTheEnd: true
      }
    default:
      return {
        text: '',
        isTheEnd: true
      }
  }
}

const getChoicesAfterVideo = (videoId) => {
  const choicesIds = afterVideos[videoId]

  if (typeof choicesIds !== 'string') {
    return choicesIds.map(choiceId => {
      return { id: choiceId, text: choices[choiceId] }
    })
  }
}

const getVideoAfterChoice = (choiceId) => {
  return afterChoices[choiceId]
}

const getShowChoiceDelay = (video) => {
  return videoShowChoiceDelays[video]
}